<html>
  <head>
    
  </head>
  <body>
    <h1 align="center">
      &#1051;&#1077;&#1082;&#1094;&#1080;&#1103; 1
    </h1>
    <p>
      &#1042;&#1089;&#1077;&#1082;&#1080; &#1080;&#1079;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090;&#1077;&#1083;&#1077;&#1085; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089; &#1077; &#1082;&#1072;&#1088;&#1090;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1088;&#1072;&#1085;&#1077; (&#1089;&#1087;&#1086;&#1088;&#1077;&#1076; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1098;&#1084;) 
      &#1085;&#1072; &#1085;&#1103;&#1082;&#1086;&#1080; &#1074;&#1093;&#1086;&#1076;&#1085;&#1080; &#1076;&#1072;&#1085;&#1085;&#1080; &#1082;&#1098;&#1084; &#1080;&#1079;&#1093;&#1086;&#1076;&#1072;.
    </p>
    <p align="center">
      <img width="480" height="100" src="file:/C:/Users/Admin/Documents/NetBeansProjects/SQLTrainingExampl/src/res/Lecture/Admin/Resources/1.JPG">
      
    </p>
    <p>
      &#1057;&#1083;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1090;&#1072; &#1085;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1103;&#1085;&#1077;&#1090;&#1086; &#1085;&#1072; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1074;&#1072;&#1085;&#1080;&#1090;&#1077; &#1076;&#1072;&#1085;&#1085;&#1080; &#1080; &#1080;&#1079;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090;&#1077;&#1083;&#1085;&#1080;&#1103; 
      &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1098;&#1084; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103; &#1076;&#1074;&#1072; &#1082;&#1083;&#1072;&#1089;&#1072; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080;:
    </p>
    <p>
      &#183; &#1082;&#1086;&#1084;&#1087;&#1102;&#1090;&#1098;&#1088;&#1085;&#1080; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; - &#1089;&#1088;&#1072;&#1074;&#1085;&#1080;&#1090;&#1077;&#1083;&#1085;&#1086; &#1083;&#1077;&#1089;&#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1103;&#1085;&#1077; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1080; &#1080; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;, 
      &#1084;&#1085;&#1086;&#1075;&#1086;&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1086;&#1088;&#1085;&#1080; &#1080;&#1079;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090;&#1077;&#1083;&#1085;&#1080; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1080;;
    </p>
    <p>
      &#183; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; &#1087;&#1086; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1080; (&#1085;&#1077;-&#1080;&#1079;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090;&#1077;&#1083;&#1085;&#1080; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080;) - &#1087;&#1088;&#1086;&#1089;&#1090; 
      &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1098;&#1084; &#1079;&#1072; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1080; &#1080; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1103;&#1085;&#1077; &#1085;&#1072; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1074;&#1072;&#1085;&#1080;&#1090;&#1077; 
      &#1076;&#1072;&#1085;&#1085;&#1080;.
    </p>
    <p>
      &#1042; &#1085;&#1072;&#1095;&#1072;&#1083;&#1085;&#1080;&#1103; &#1077;&#1090;&#1072;&#1087; &#1085;&#1072; &#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077;&#1090;&#1086; &#1087;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080;&#1088;&#1072;&#1085;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1090;&#1086; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1089;&#1077; 
      &#1086;&#1090;&#1076;&#1077;&#1083;&#1103; &#1085;&#1072; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1074;&#1072;&#1085;&#1077;&#1090;&#1086; &#1085;&#1072; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1098;&#1084; &#1079;&#1072; &#1088;&#1077;&#1096;&#1072;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072;. &#1063;&#1077;&#1089;&#1090;&#1086; 
      &#1086;&#1073;&#1072;&#1095;&#1077; &#1089;&#1077; &#1086;&#1082;&#1072;&#1079;&#1074;&#1072;, &#1095;&#1077; &#1074;&#1098;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1090;&#1072; (&#1080;&#1083;&#1080; &#1085;&#1077;&#1074;&#1098;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1090;&#1072;) &#1079;&#1072; &#1088;&#1077;&#1096;&#1072;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; 
      &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1077;&#1085; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080; &#1085;&#1077; &#1089;&#1072;&#1084;&#1086; &#1086;&#1090; &#1080;&#1079;&#1073;&#1088;&#1072;&#1085;&#1080;&#1103; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1098;&#1084;, &#1085;&#1086; &#1080; &#1086;&#1090; &#1090;&#1086;&#1074;&#1072; 
      &#1082;&#1072;&#1082;&#1074;&#1080; &#1082;&#1086;&#1085;&#1094;&#1077;&#1087;&#1094;&#1080;&#1080; &#1089;&#1077; &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072;&#1090; &#1079;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1103;&#1085;&#1077; &#1085;&#1072; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1074;&#1072;&#1085;&#1080;&#1090;&#1077; &#1076;&#1072;&#1085;&#1085;&#1080;.
    </p>
    <p>
      &#1055;&#1086;&#1084;&#1080;&#1089;&#1083;&#1077;&#1090;&#1077; &#1079;&#1072; &#1085;&#1072;&#1081;-&#1087;&#1088;&#1086;&#1089;&#1090;&#1080;&#1103; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1085;&#1072; &#1080;&#1079;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1077;, &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072;&#1081;&#1082;&#1080; &#1092;&#1086;&#1088;&#1084;&#1091;&#1083;&#1072;&#1090;&#1072;:
    </p>
    <p align="center">
      Y=X<sup>2</sup>+5X,
    </p>
    <p>
      &#1082;&#1098;&#1076;&#1077;&#1090;&#1086; X &#1080; Y &#1089;&#1072; &#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1095;&#1085;&#1080; &#1095;&#1080;&#1089;&#1083;&#1072;, &#1082;&#1086;&#1080;&#1090;&#1086; &#1089;&#1072; &#1090;&#1091;&#1082; &#1077;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1085;&#1080; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1080; &#1086;&#1090; 
      &#1076;&#1072;&#1085;&#1085;&#1080; (&#1077;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1080; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1080;).
    </p>
    <p>
      &#1055;&#1088;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080;&#1088;&#1072;&#1085;&#1077; &#1085;&#1072; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1098;&#1084; &#1079;&#1072; &#1088;&#1077;&#1096;&#1072;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1090;&#1086;&#1079;&#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; (&#1092;&#1086;&#1088;&#1084;&#1091;&#1083;&#1072; &#1079;&#1072; 
      &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080;&#1088;&#1072;&#1085;&#1077;) &#1091;&#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1080;, &#1085;&#1072;&#1081;-&#1087;&#1088;&#1086;&#1089;&#1090;&#1080;&#1103;&#1090; &#1074;&#1080;&#1076; &#1076;&#1072;&#1085;&#1085;&#1080; - &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1087;&#1088;&#1086;&#1084;&#1077;&#1085;&#1083;&#1080;&#1074;&#1072; (&#1061; &#1080; 
      Y &#1087;&#1088;&#1086;&#1084;&#1077;&#1085;&#1083;&#1080;&#1074;&#1080; &#1089;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1077;&#1085;&#1080; &#1074; &#1087;&#1088;&#1086;&#1089;&#1090;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1072;). &#1048;&#1084;&#1072;&#1081;&#1090;&#1077; &#1087;&#1088;&#1077;&#1076;&#1074;&#1080;&#1076;, &#1095;&#1077; 
      &#1087;&#1088;&#1086;&#1089;&#1090;&#1072;&#1090;&#1072; &#1087;&#1088;&#1086;&#1084;&#1077;&#1085;&#1083;&#1080;&#1074;&#1072; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1080;&#1090;&#1077; &#1079;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080;&#1088;&#1072;&#1085;&#1077; &#1089;&#1077; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1079;&#1080;&#1088;&#1072; &#1089; 
      &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085; &#1090;&#1080;&#1087; &#1089;&#1090;&#1086;&#1081;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1082;&#1086;&#1080;&#1090;&#1086; &#1090;&#1088;&#1103;&#1073;&#1074;&#1072; &#1076;&#1072; &#1073;&#1098;&#1076;&#1072;&#1090; &#1080;&#1079;&#1073;&#1088;&#1072;&#1085;&#1080; &#1087;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077; &#1085;&#1072; 
      &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080;&#1088;&#1072;&#1085;&#1077;&#1090;&#1086;. &#1044;&#1086;&#1088;&#1080; &#1080; &#1074; &#1090;&#1086;&#1079;&#1080; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081; &#1087;&#1088;&#1086;&#1089;&#1090;&#1080;&#1103;&#1090; &#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1076;&#1072; &#1080;&#1079;&#1073;&#1077;&#1088;&#1077;&#1090;&#1077; 
      &#1090;&#1080;&#1087;&#1072; &#1085;&#1072; &#1087;&#1088;&#1086;&#1084;&#1077;&#1085;&#1083;&#1080;&#1074;&#1072;, &#1080; &#1090;&#1086;&#1079;&#1080; &#1080;&#1079;&#1073;&#1086;&#1088; &#1084;&#1086;&#1078;&#1077; &#1076;&#1072; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080; &#1086;&#1090; &#1074;&#1098;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1090;&#1072; &#1080;&#1083;&#1080; 
      &#1085;&#1077;&#1074;&#1098;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1090;&#1072; &#1079;&#1072; &#1088;&#1077;&#1096;&#1072;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1090;&#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1079;&#1072; &#1076;&#1072; 
      &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1074;&#1072;&#1090; &#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1095;&#1085;&#1080; &#1076;&#1072;&#1085;&#1085;&#1080; &#1085;&#1077; &#1089;&#1072; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1098;&#1095;&#1085;&#1080;, &#1073;&#1080;&#1090;&#1072;, &#1088;&#1072;&#1079;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;).
    </p>
    <p>
      &#1044;&#1072; &#1088;&#1072;&#1079;&#1075;&#1083;&#1077;&#1076;&#1072;&#1084;&#1077; &#1076;&#1088;&#1091;&#1075; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;:
    </p>
    <pre>S=a<sub>1</sub>+a<sub>2</sub>+...+a<sub>N</sub>.</pre>
    <p>
      &#1056;&#1077;&#1096;&#1072;&#1074;&#1072;&#1085;&#1077;&#1090;&#1086; &#1085;&#1072; &#1090;&#1086;&#1079;&#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; &#1074; &#1086;&#1073;&#1097;&#1080;&#1103; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077; &#1076;&#1072; &#1073;&#1098;&#1076;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1086; &#1089;&#1072;&#1084;&#1086; 
      &#1089; &#1087;&#1088;&#1086;&#1089;&#1090;&#1080; &#1087;&#1088;&#1086;&#1084;&#1077;&#1085;&#1083;&#1080;&#1074;&#1080;. &#1058;&#1091;&#1082; &#1085;&#1077; &#1089;&#1077; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1074;&#1072; &#1085;&#1080;&#1090;&#1086; &#1077;&#1076;&#1080;&#1085; &#1085;&#1086;&#1084;&#1077;&#1088;, &#1072; &#1089;&#1077;&#1088;&#1080;&#1103; &#1086;&#1090; 
      &#1085;&#1086;&#1084;&#1077;&#1088;&#1072;. &#1042; &#1090;&#1086;&#1079;&#1080; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080;&#1088;&#1072;&#1085;&#1077;&#1090;&#1086; &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072; &#1090;&#1080;&#1087; &#1076;&#1072;&#1085;&#1085;&#1080;, &#1082;&#1072;&#1090;&#1086; &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; 
      &#1084;&#1072;&#1089;&#1080;&#1074; - &#1082;&#1086;&#1083;&#1077;&#1082;&#1094;&#1080;&#1103; &#1086;&#1090; &#1077;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1080;, &#1074;&#1089;&#1103;&#1082;&#1072; &#1086;&#1090; &#1082;&#1086;&#1080;&#1090;&#1086; &#1077; &#1089;&#1074;&#1098;&#1088;&#1079;&#1072;&#1085;&#1072; &#1089; &#1087;&#1086;&#1076;&#1088;&#1077;&#1076;&#1077;&#1085; &#1085;&#1072;&#1073;&#1086;&#1088; 
      &#1086;&#1090; &#1094;&#1077;&#1083;&#1080; &#1095;&#1080;&#1089;&#1083;&#1072;, &#1085;&#1072;&#1088;&#1077;&#1095;&#1077;&#1085;&#1080; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1080;. &#1042;&#1089;&#1080;&#1095;&#1082;&#1080; &#1077;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1080; &#1090;&#1088;&#1103;&#1073;&#1074;&#1072; &#1076;&#1072; &#1080;&#1084;&#1072;&#1090; &#1077;&#1076;&#1080;&#1085; &#1080; 
      &#1089;&#1098;&#1097; &#1074;&#1080;&#1076; &#1090;&#1077;&#1093;&#1085;&#1080;&#1090;&#1077; &#1089;&#1090;&#1086;&#1081;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1082;&#1086;&#1080;&#1090;&#1086; &#1097;&#1077; &#1073;&#1098;&#1076;&#1072;&#1090; &#1090;&#1080;&#1087;&#1098;&#1090; &#1085;&#1072; &#1084;&#1072;&#1089;&#1080;&#1074;&#1072;. &#1042; &#1090;&#1086;&#1079;&#1080; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081; 
      &#1085;&#1086;&#1084;&#1077;&#1088;&#1072;&#1090;&#1072; a<sub>1</sub>, a<sub>2</sub>,..., 
      a<sub>N &#1089;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1077;&#1085;&#1080; &#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1072;&#1090;&#1072; &#1086;&#1090; &#1084;&#1072;&#1089;&#1080;&#1074; </sub>A(1), 
      A(2),..., A(N).
    </p>
    <p>
      &#1043;&#1086;&#1088;&#1085;&#1080;&#1090;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1080; &#1087;&#1086;&#1082;&#1072;&#1079;&#1074;&#1072;&#1090;, &#1095;&#1077; &#1087;&#1088;&#1086;&#1084;&#1103;&#1085;&#1072;&#1090;&#1072; &#1085;&#1072; &#1074;&#1080;&#1076;&#1072; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; &#1085;&#1072;&#1083;&#1072;&#1075;&#1072; 
      &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072;&#1085;&#1077;&#1090;&#1086; &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1080; &#1090;&#1080;&#1087;&#1086;&#1074;&#1077; &#1076;&#1072;&#1085;&#1085;&#1080;.
    </p>
    <p>
      &#1056;&#1072;&#1085;&#1085;&#1080;&#1090;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1085;&#1080; &#1077;&#1079;&#1080;&#1094;&#1080; (FORTRAN, ALGOL-60) &#1089;&#1072; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080; &#1079;&#1072; &#1088;&#1077;&#1096;&#1072;&#1074;&#1072;&#1085;&#1077; 
      &#1085;&#1072; &#1085;&#1072;&#1091;&#1095;&#1085;&#1080; &#1080; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1080;&#1079;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090;&#1077;&#1083;&#1085;&#1080; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080;. &#1053;&#1072; &#1090;&#1077;&#1079;&#1080; &#1077;&#1079;&#1080;&#1094;&#1080; &#1073;&#1103;&#1093;&#1072; 
      &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072;&#1085;&#1080; &#1089;&#1072;&#1084;&#1086; &#1075;&#1086;&#1088;&#1085;&#1080;&#1090;&#1077; &#1090;&#1080;&#1087;&#1086;&#1074;&#1077; &#1076;&#1072;&#1085;&#1085;&#1080; (&#1087;&#1088;&#1086;&#1089;&#1090;&#1080; &#1087;&#1088;&#1086;&#1084;&#1077;&#1085;&#1083;&#1080;&#1074;&#1080; &#1080; &#1084;&#1072;&#1089;&#1080;&#1074;&#1080;), &#1082;&#1086;&#1077;&#1090;&#1086; 
      &#1073;&#1077;&#1096;&#1077; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1098;&#1095;&#1085;&#1086;.
    </p>
    <p>
      &#1054;&#1090; &#1082;&#1088;&#1072;&#1103; &#1085;&#1072; 60-&#1090;&#1077; &#1075;&#1086;&#1076;&#1080;&#1085;&#1080; &#1082;&#1086;&#1084;&#1087;&#1102;&#1090;&#1088;&#1080;&#1090;&#1077; &#1089;&#1077; &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072;&#1090; &#1080;&#1085;&#1090;&#1077;&#1085;&#1079;&#1080;&#1074;&#1085;&#1086; &#1079;&#1072; &#1088;&#1077;&#1096;&#1072;&#1074;&#1072;&#1085;&#1077; 
      &#1085;&#1072; &#1090;.&#1085;&#1072;&#1088;. &#1053;&#1077;-&#1080;&#1079;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090;&#1077;&#1083;&#1085;&#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1080;, &#1089;&#1074;&#1098;&#1088;&#1079;&#1072;&#1085;&#1080; &#1089; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072;&#1090;&#1072; &#1085;&#1072; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1080; 
      &#1074;&#1080;&#1076;&#1086;&#1074;&#1077; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;. &#1054;&#1073;&#1084;&#1080;&#1089;&#1083;&#1077;&#1090;&#1077; &#1087;&#1086;&#1103;&#1074;&#1072;&#1090;&#1072; &#1085;&#1072; &#1085;&#1086;&#1074;&#1080; &#1090;&#1080;&#1087;&#1086;&#1074;&#1077; &#1076;&#1072;&#1085;&#1085;&#1080;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1087;&#1088;&#1080; 
      &#1086;&#1087;&#1088;&#1086;&#1089;&#1090;&#1077;&#1085;&#1080;&#1090;&#1077; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; &#1087;&#1086; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072;&#1090;&#1072; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1080;.
    </p>
    <p>
      &#1047;&#1072;&#1076;&#1072;&#1095;&#1072; 1. &#1048;&#1079;&#1095;&#1080;&#1089;&#1083;&#1103;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1079;&#1072;&#1087;&#1083;&#1072;&#1090;&#1080;&#1090;&#1077;.
    </p>
    <p>
      &#1053;&#1080;&#1077; &#1088;&#1072;&#1079;&#1075;&#1083;&#1077;&#1078;&#1076;&#1072;&#1084;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1089; &#1076;&#1074;&#1077; &#1086;&#1087;&#1088;&#1086;&#1089;&#1090;&#1077;&#1085;&#1080; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;:
    </p>
    <p>
      &#183; &#1085;&#1072; &#1089;&#1098;&#1090;&#1088;&#1091;&#1076;&#1085;&#1080;&#1082;&#1098;&#1090; &#1089;&#1077; &#1079;&#1072;&#1087;&#1083;&#1072;&#1097;&#1072; &#1074;&#1098;&#1079;&#1085;&#1072;&#1075;&#1088;&#1072;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1074;&#1098;&#1079; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072; &#1085;&#1072; &#1085;&#1077;&#1075;&#1086;&#1074;&#1072;&#1090;&#1072; 
      &#1079;&#1072;&#1087;&#1083;&#1072;&#1090;&#1072;;
    </p>
    <ul>
      <li>
        &#1085;&#1077; &#1089;&#1077; &#1074;&#1079;&#1077;&#1084;&#1072;&#1090; &#1087;&#1088;&#1077;&#1076;&#1074;&#1080;&#1076; &#1076;&#1072;&#1085;&#1098;&#1094;&#1080; &#1080; &#1091;&#1076;&#1088;&#1098;&#1078;&#1082;&#1080;.
      </li>
    </ul>
    <p>
      &#1048;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;&#1090;&#1072; &#1079;&#1072; &#1089;&#1083;&#1091;&#1078;&#1080;&#1090;&#1077;&#1083;&#1103;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1072; &#1079;&#1072; &#1088;&#1077;&#1096;&#1072;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1090;&#1086;&#1079;&#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;, &#1077; 
      &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1077;&#1085;&#1072; &#1074; &#1089;&#1083;&#1077;&#1076;&#1085;&#1072;&#1090;&#1072; &#1082;&#1072;&#1088;&#1090;&#1072;: &#1048;&#1047;&#1063;&#1048;&#1057;&#1051;&#1045;&#1053;&#1048;&#1045;:
    </p>
    <table border="1" cellspacing="0" cellpadding="0">
      <tr>
        <td width="156" valign="top">
          <p>
            &#1060;&#1072;&#1084;&#1080;&#1083;&#1085;&#1086; &#1080;&#1084;&#1077;, &#1048;&#1084;&#1077;, &#1041;&#1072;&#1097;&#1080;&#1085;&#1086; &#1080;&#1084;&#1077;
          </p>
        </td>
        <td width="156" valign="top">
          <p>
            &#1047;&#1072;&#1087;&#1083;&#1072;&#1090;&#1072;
          </p>
        </td>
        <td width="156" valign="top">
          <p>
            &#1041;&#1088;&#1086;&#1081; &#1085;&#1072; &#1086;&#1090;&#1088;&#1072;&#1073;&#1086;&#1090;&#1077;&#1085;&#1080;&#1090;&#1077; &#1076;&#1085;&#1080; &#1085;&#1072; &#1084;&#1077;&#1089;&#1077;&#1094;
          </p>
        </td>
        <td width="156" valign="top">
          <p>
            &#1057;&#1091;&#1084;&#1072;
          </p>
        </td>
      </tr>
      <tr>
        <td width="156" valign="top">
          <p>
            FIO
          </p>
        </td>
        <td width="156" valign="top">
          <p>
            O
          </p>
        </td>
        <td width="156" valign="top">
          <p>
            K<sub>o</sub>
          </p>
        </td>
        <td width="156" valign="top">
          <p>
            S
          </p>
        </td>
      </tr>
    </table>
    <p>
      &#1047;&#1072; &#1074;&#1089;&#1077;&#1082;&#1080; &#1089;&#1083;&#1091;&#1078;&#1080;&#1090;&#1077;&#1083; &#1085;&#1072;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1072;&#1090;&#1072; &#1089;&#1091;&#1084;&#1072; &#1079;&#1072; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085; &#1084;&#1077;&#1089;&#1077;&#1094; &#1089;&#1077; &#1080;&#1079;&#1095;&#1080;&#1089;&#1083;&#1103;&#1074;&#1072;, &#1082;&#1072;&#1090;&#1086; 
      &#1089;&#1077; &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072; &#1089;&#1083;&#1077;&#1076;&#1085;&#1072;&#1090;&#1072; &#1092;&#1086;&#1088;&#1084;&#1091;&#1083;&#1072;:
    </p>
    <pre>S=K<sub>o</sub>O/K<sub>r</sub>,</pre>
    <p>
      &#1082;&#1098;&#1076;&#1077;&#1090;&#1086; K<sub>r</sub> &#1077; &#1073;&#1088;&#1086;&#1103;&#1090; &#1085;&#1072; 
      &#1088;&#1072;&#1073;&#1086;&#1090;&#1085;&#1080;&#1090;&#1077; &#1076;&#1085;&#1080; &#1074; &#1076;&#1072;&#1076;&#1077;&#1085; &#1084;&#1077;&#1089;&#1077;&#1094;.
    </p>
    <p>
      &#1047;&#1072; &#1074;&#1089;&#1077;&#1082;&#1080; &#1089;&#1083;&#1091;&#1078;&#1080;&#1090;&#1077;&#1083; &#1089;&#1098;&#1086;&#1090;&#1074;&#1077;&#1090;&#1085;&#1080;&#1090;&#1077; &#1076;&#1072;&#1085;&#1085;&#1080; &#1080;&#1084;&#1072;&#1090; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1072; &#1089;&#1090;&#1086;&#1081;&#1085;&#1086;&#1089;&#1090;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;:
    </p>
    <table border="0" cellspacing="1" cellpadding="0">
      <tr>
        <td valign="top">
          <p>
            <u>&#1048;&#1074;&#1072;&#1085;&#1086;&#1074; &#1048;&#1074;&#1072;&#1085; &#1048;&#1074;&#1072;&#1085;&#1086;&#1074;&#1080;&#1095;</u>
          </p>
        </td>
        <td valign="top">
          <p>
            <u>1 800</u>
          </p>
        </td>
        <td valign="top">
          <p>
            <u>24</u>
          </p>
        </td>
        <td valign="top">
          <p>
            <u>1800</u>
          </p>
        </td>
      </tr>
      <tr>
        <td valign="top">
          
        </td>
        <td valign="top">
          
        </td>
        <td valign="top">
          
        </td>
        <td valign="top">
          
        </td>
      </tr>
    </table>
    <p>
      &#1058;&#1077;&#1079;&#1080; &#1094;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080;&#1084;&#1072;&#1090; &#1089;&#1084;&#1080;&#1089;&#1098;&#1083; &#1089;&#1072;&#1084;&#1086; &#1074;&#1098;&#1074; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1103;&#1090;&#1072; &#1087;&#1086;&#1084;&#1077;&#1078;&#1076;&#1091; &#1089;&#1080;. &#1054;&#1090;&#1076;&#1077;&#1083;&#1085;&#1086; 
      &#1080;&#1079;&#1073;&#1088;&#1072;&#1085;&#1080;&#1103;&#1090; &#1085;&#1086;&#1084;&#1077;&#1088; 1800 &#1075;&#1091;&#1073;&#1080; &#1089;&#1074;&#1086;&#1077;&#1090;&#1086; &#1089;&#1084;&#1080;&#1089;&#1083;&#1077;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1085;&#1086; &#1077; 
      &#1085;&#1077;&#1074;&#1098;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1076;&#1072; &#1089;&#1077; &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072; &#1090;&#1072;&#1082;&#1098;&#1074; &#1090;&#1080;&#1087; &#1076;&#1072;&#1085;&#1085;&#1080; &#1082;&#1072;&#1090;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1072; &#1087;&#1088;&#1086;&#1084;&#1077;&#1085;&#1083;&#1080;&#1074;&#1072;. 
      &#1057;&#1098;&#1097;&#1077;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1085;&#1072;&#1073;&#1086;&#1088;&#1098;&#1090; &#1086;&#1090; &#1089;&#1098;&#1086;&#1090;&#1074;&#1077;&#1090;&#1085;&#1080; &#1089;&#1090;&#1086;&#1081;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1082;&#1086;&#1080;&#1090;&#1086; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1079;&#1080;&#1088;&#1072;&#1090; 
      &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085; &#1089;&#1083;&#1091;&#1078;&#1080;&#1090;&#1077;&#1083;, &#1080;&#1084;&#1072; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1080; &#1090;&#1080;&#1087;&#1086;&#1074;&#1077; (&#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1080;&#1095;&#1085;&#1080; &#1080; &#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;), &#1090;.&#1077;. &#1053;&#1077; 
      &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1076;&#1072; &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072;&#1090;&#1077; &#1090;&#1086;&#1079;&#1080; &#1074;&#1080;&#1076; &#1076;&#1072;&#1085;&#1085;&#1080;, &#1082;&#1072;&#1090;&#1086; &#1084;&#1072;&#1089;&#1080;&#1074;, &#1079;&#1072; &#1076;&#1072; &#1075;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1077;. 
      &#1055;&#1086; &#1090;&#1086;&#1079;&#1080; &#1085;&#1072;&#1095;&#1080;&#1085; &#1087;&#1086;&#1085;&#1103;&#1090;&#1080;&#1103;&#1090;&#1072; &quot;&#1087;&#1088;&#1086;&#1089;&#1090;&#1072; &#1087;&#1088;&#1086;&#1084;&#1077;&#1085;&#1083;&#1080;&#1074;&#1072;&quot; &#1080; &quot;&#1084;&#1072;&#1089;&#1080;&#1074;&quot; &#1085;&#1077; &#1089;&#1072; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1098;&#1095;&#1085;&#1080;, 
      &#1079;&#1072; &#1076;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1103;&#1090; &#1089;&#1098;&#1086;&#1090;&#1074;&#1077;&#1090;&#1085;&#1072;&#1090;&#1072; &#1082;&#1072;&#1088;&#1090;&#1072;.
    </p>
    <p>
      &#1055;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1077;&#1085;&#1080; &#1089;&#1072; &#1088;&#1077;&#1076;&#1080;&#1094;&#1072; &#1085;&#1086;&#1074;&#1080; &#1087;&#1086;&#1085;&#1103;&#1090;&#1080;&#1103; [[1.1]], &#1082;&#1086;&#1080;&#1090;&#1086; &#1086;&#1087;&#1080;&#1089;&#1074;&#1072;&#1090; &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1080; 
      &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1103;&#1085;&#1080;&#1103; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1080; &#1074; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1090;&#1072; &#1085;&#1072; &#1085;&#1077;-&#1094;&#1080;&#1092;&#1088;&#1086;&#1074;&#1080;&#1090;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1080;.
    </p>
    <p>
      &#1045;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1098;&#1090; &#1086;&#1090; &#1076;&#1072;&#1085;&#1085;&#1080; (&#1087;&#1086;&#1083;&#1077;) &#1077; &#1085;&#1072;&#1081;-&#1084;&#1072;&#1083;&#1082;&#1072;&#1090;&#1072; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1072; &#1086;&#1090; &#1080;&#1084;&#1077;&#1085;&#1072;&#1090;&#1072; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1080;.
    </p>
    <p>
      &#1047;&#1072; &#1090;&#1086;&#1079;&#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1077;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1080;&#1090;&#1077; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1080;&#1090;&#1077; &#1089;&#1072; FIO, O, K<sub>o</sub>, 
      S.
    </p>
    <p>
      &#1047;&#1072; &#1076;&#1072; &#1089;&#1077; &#1086;&#1087;&#1080;&#1096;&#1077; &#1082;&#1072;&#1088;&#1090;&#1072;&#1090;&#1072; &#1085;&#1072; &#1089;&#1083;&#1091;&#1078;&#1080;&#1090;&#1077;&#1083;&#1103;, &#1089;&#1077; &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072; &#1087;&#1086;&#1085;&#1103;&#1090;&#1080;&#1077;&#1090;&#1086; &quot;&#1051;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; 
      &#1079;&#1072;&#1087;&#1080;&#1089;&quot;.
    </p>
    <p>
      &#1051;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1079;&#1072;&#1087;&#1080;&#1089; - &#1085;&#1072;&#1080;&#1084;&#1077;&#1085;&#1091;&#1074;&#1072;&#1085; &#1085;&#1072;&#1073;&#1086;&#1088; &#1086;&#1090; &#1076;&#1072;&#1085;&#1085;&#1080; (&#1087;&#1086;&#1083;&#1077;&#1090;&#1072;).
    </p>
    <p>
      &#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1079;&#1072; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1079;&#1072;&#1087;&#1080;&#1089; &#1077; &#1090;&#1077;&#1082;&#1091;&#1097;&#1072;&#1090;&#1072; &#1089;&#1090;&#1086;&#1081;&#1085;&#1086;&#1089;&#1090; &#1085;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;&#1090;&#1077;.
    </p>
    <p>
      &#1047;&#1072; &#1076;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1074;&#1072; &#1094;&#1077;&#1083;&#1080;&#1103; &#1085;&#1072;&#1073;&#1086;&#1088; &#1086;&#1090; &#1087;&#1077;&#1088;&#1089;&#1086;&#1085;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1072;&#1085;&#1080; &#1082;&#1072;&#1088;&#1090;&#1080;, &#1087;&#1086;&#1085;&#1103;&#1090;&#1080;&#1077;&#1090;&#1086; 
      &quot;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1092;&#1072;&#1081;&#1083;&quot;
    </p>
    <p>
      &#1051;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1103;&#1090; &#1092;&#1072;&#1081;&#1083; &#1077; &#1085;&#1072;&#1080;&#1084;&#1077;&#1085;&#1091;&#1074;&#1072;&#1085; &#1085;&#1072;&#1073;&#1086;&#1088; &#1086;&#1090; &#1074;&#1089;&#1080;&#1095;&#1082;&#1080; &#1089;&#1083;&#1091;&#1095;&#1072;&#1080; &#1085;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1086;&#1090; &#1076;&#1072;&#1076;&#1077;&#1085; 
      &#1090;&#1080;&#1087;.
    </p>
    <p>
      &#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1079;&#1072; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1092;&#1072;&#1081;&#1083; &#1044;&#1054;&#1057;&#1058;&#1066;&#1055;:
    </p>
    <p>
      <img width="490" height="205" src="file:/C:/Users/Admin/Documents/NetBeansProjects/SQLTrainingExampl/src/res/Lecture/Admin/Resources/2.JPG">
      
    </p>
    <p>
      &#1055;&#1086; &#1090;&#1086;&#1079;&#1080; &#1085;&#1072;&#1095;&#1080;&#1085;, &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1090;&#1072; &#1085;&#1072; &#1074;&#1098;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1090;&#1077; &#1082;&#1086;&#1085;&#1094;&#1077;&#1087;&#1094;&#1080;&#1080;, &#1077; &#1074;&#1098;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1076;&#1072; &#1089;&#1077; 
      &#1086;&#1087;&#1080;&#1096;&#1072;&#1090; &#1089;&#1098;&#1086;&#1090;&#1074;&#1077;&#1090;&#1085;&#1080;&#1090;&#1077; &#1076;&#1072;&#1085;&#1085;&#1080;. &#1047;&#1072; &#1076;&#1072; &#1089;&#1077; &#1087;&#1086;&#1082;&#1072;&#1078;&#1072;&#1090; &#1090;&#1077;&#1079;&#1080; &#1087;&#1086;&#1085;&#1103;&#1090;&#1080;&#1103; &#1085;&#1072; &#1089;&#1098;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1080; 
      &#1077;&#1079;&#1080;&#1094;&#1080; &#1079;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080;&#1088;&#1072;&#1085;&#1077;, &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080; &#1082;&#1072;&#1082;&#1090;&#1086; &#1079;&#1072; &#1082;&#1086;&#1084;&#1087;&#1102;&#1090;&#1098;&#1088;&#1085;&#1080; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080;, &#1090;&#1072;&#1082;&#1072; &#1080; 
      &#1079;&#1072; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; &#1087;&#1086; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1080;, &#1085;&#1086;&#1074;&#1080; &#1090;&#1080;&#1087;&#1086;&#1074;&#1077; &#1076;&#1072;&#1085;&#1085;&#1080;
    </p>
    <p>
      &#1042; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1080;&#1095;&#1085;&#1080;&#1103; &#1077;&#1079;&#1080;&#1082; Pascal &#1089;&#1077; &#1074;&#1098;&#1074;&#1077;&#1078;&#1076;&#1072; &#1090;&#1080;&#1087; &#1076;&#1072;&#1085;&#1085;&#1080;, &#1082;&#1072;&#1090;&#1086; &#1079;&#1072;&#1087;&#1080;&#1089; (RECORD) - 
      &#1089;&#1083;&#1086;&#1078;&#1085;&#1072; &#1087;&#1088;&#1086;&#1084;&#1077;&#1085;&#1083;&#1080;&#1074;&#1072; &#1089; &#1085;&#1103;&#1082;&#1086;&#1083;&#1082;&#1086; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;, &#1082;&#1086;&#1080;&#1090;&#1086; &#1084;&#1086;&#1075;&#1072;&#1090; &#1076;&#1072; &#1080;&#1084;&#1072;&#1090; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1080; 
      &#1090;&#1080;&#1087;&#1086;&#1074;&#1077;. &#1054;&#1089;&#1074;&#1077;&#1085; &#1090;&#1086;&#1074;&#1072; &#1076;&#1086;&#1089;&#1090;&#1098;&#1087;&#1098;&#1090; &#1076;&#1086; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1080;&#1090;&#1077; &#1085;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072; (&#1087;&#1086;&#1083;&#1077;&#1090;&#1072;&#1090;&#1072;) &#1089;&#1077; 
      &#1080;&#1079;&#1074;&#1098;&#1088;&#1096;&#1074;&#1072; &#1085;&#1077; &#1086;&#1090; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1072;, &#1072; &#1086;&#1090; &#1080;&#1084;&#1077;&#1090;&#1086;. &#1055;&#1088;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080;&#1088;&#1072;&#1085;&#1077; &#1085;&#1072; &#1079;&#1072;&#1076;&#1072;&#1095;&#1072; 1 &#1074; 
      Pascal &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1103;&#1090; &#1079;&#1072;&#1087;&#1080;&#1089; &#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1077;&#1085; &#1086;&#1090; &#1090;&#1080;&#1087;&#1072; &#1076;&#1072;&#1085;&#1085;&#1080; RECORD, &#1085;&#1072;&#1073;&#1086;&#1088;&#1098;&#1090; &#1086;&#1090; 
      &#1082;&#1086;&#1087;&#1080;&#1103; &#1085;&#1072; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1085;&#1072; &#1089;&#1083;&#1091;&#1078;&#1080;&#1090;&#1077;&#1083;&#1080;&#1090;&#1077; (&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1092;&#1072;&#1081;&#1083;) &#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1077;&#1085; 
      &#1086;&#1090; &quot;&#1092;&#1080;&#1079;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&quot; &#1092;&#1072;&#1081;&#1083;, &#1092;&#1086;&#1088;&#1084;&#1080;&#1088;&#1072;&#1085; &#1086;&#1090; Pascal &#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1072;&#1090;&#1072; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;.
    </p>
    <pre>Salary = RECORD</pre>
    <pre>      FIO: string;</pre>
    <pre>      O:  real;</pre>
    <pre>      Ko: real;</pre>
    <pre>      S:  real;</pre>
    <pre>END;</pre>
    <p>
      &#1054;&#1090;&#1073;&#1077;&#1083;&#1103;&#1079;&#1074;&#1072;&#1084;&#1077; &#1074;&#1072;&#1078;&#1085;&#1072;&#1090;&#1072; &#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090; &#1085;&#1072; &#1090;&#1072;&#1082;&#1080;&#1074;&#1072; &#1085;&#1077;-&#1094;&#1080;&#1092;&#1088;&#1086;&#1074;&#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1080;. &#1058;&#1077;&#1079;&#1080; 
      &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; &#1089;&#1077; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1079;&#1080;&#1088;&#1072;&#1090; &#1089; &#1075;&#1086;&#1083;&#1103;&#1084;&#1086; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1076;&#1072;&#1085;&#1085;&#1080; (&#1075;&#1086;&#1083;&#1103;&#1084; &#1073;&#1088;&#1086;&#1081; 
      &#1089;&#1083;&#1091;&#1078;&#1080;&#1090;&#1077;&#1083;&#1080;, &#1075;&#1086;&#1083;&#1103;&#1084; &#1073;&#1088;&#1086;&#1081; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1080; &#1080; &#1076;&#1088;.). &#1058;&#1077;&#1079;&#1080; &#1076;&#1072;&#1085;&#1085;&#1080; &#1086;&#1073;&#1080;&#1082;&#1085;&#1086;&#1074;&#1077;&#1085;&#1086; 
      &#1089;&#1077; &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072;&#1090; &#1079;&#1072; &#1088;&#1077;&#1096;&#1072;&#1074;&#1072;&#1085;&#1077;&#1090;&#1086; &#1085;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1084;&#1085;&#1086;&#1075;&#1086;&#1082;&#1088;&#1072;&#1090;&#1085;&#1086; (&#1079;&#1072;&#1087;&#1083;&#1072;&#1090;&#1080;&#1090;&#1077; &#1089;&#1077; 
      &#1090;&#1072;&#1082;&#1089;&#1091;&#1074;&#1072;&#1090; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086; &#1074;&#1089;&#1077;&#1082;&#1080; &#1084;&#1077;&#1089;&#1077;&#1094;), &#1087;&#1086;&#1088;&#1072;&#1076;&#1080; &#1082;&#1086;&#1077;&#1090;&#1086; &#1076;&#1072;&#1085;&#1085;&#1080;&#1090;&#1077; &#1090;&#1088;&#1103;&#1073;&#1074;&#1072; &#1076;&#1072; &#1089;&#1077; 
      &#1089;&#1098;&#1093;&#1088;&#1072;&#1085;&#1103;&#1074;&#1072;&#1090; &#1074; &#1087;&#1072;&#1084;&#1077;&#1090;&#1090;&#1072; &#1085;&#1072; &#1082;&#1086;&#1084;&#1087;&#1102;&#1090;&#1098;&#1088;&#1072; &#1079;&#1072; &#1076;&#1098;&#1083;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;. &#1047;&#1072; &#1076;&#1098;&#1083;&#1075;&#1086;&#1089;&#1088;&#1086;&#1095;&#1085;&#1086; 
      &#1089;&#1098;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1074;&#1080;&#1085;&#1072;&#1075;&#1080; &#1089;&#1077; &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072; &#1074;&#1098;&#1085;&#1096;&#1085;&#1072; &#1087;&#1072;&#1084;&#1077;&#1090;.
    </p>
    <p>
      &#1042;&#1098;&#1074; &#1074;&#1088;&#1098;&#1079;&#1082;&#1072; &#1089; &#1090;&#1086;&#1074;&#1072;, &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;&#1090;&#1086; &#1085;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; 1 &#1089;&#1077; &#1089;&#1098;&#1089;&#1090;&#1086;&#1080; &#1086;&#1090; &#1076;&#1074;&#1072; &#1077;&#1090;&#1072;&#1087;&#1072;.
    </p>
    <p>
      1. &#1042;&#1098;&#1074;&#1077;&#1078;&#1076;&#1072;&#1085;&#1077; &#1085;&#1072; &#1087;&#1098;&#1088;&#1074;&#1086;&#1085;&#1072;&#1095;&#1072;&#1083;&#1085;&#1080; &#1076;&#1072;&#1085;&#1085;&#1080; &#1080; &#1074;&#1098;&#1074;&#1077;&#1078;&#1076;&#1072;&#1085;&#1077; &#1074;&#1098;&#1074; &#1074;&#1098;&#1085;&#1096;&#1085;&#1072; &#1087;&#1072;&#1084;&#1077;&#1090;.
    </p>
    <pre>type</pre>
    <pre>Salary = RECORD</pre>
    <pre>FIO:      string;</pre>
    <pre>O:        real;</pre>
    <pre>Ko:       real;</pre>
    <pre>S:        real;</pre>
    <pre>END;</pre>
    <pre>FSalary = File of Salary;</pre>
    <pre>var</pre>
    <pre>F: FSalary;</pre>
    <pre>...</pre>
    <pre>{ &#1042;&#1098;&#1074;&#1077;&#1078;&#1076;&#1072;&#1085;&#1077; &#1085;&#1072; &#1076;&#1072;&#1085;&#1080;&#1090;&#1077; }</pre>
    <pre>repeat</pre>
    <pre>write('&#1042;&#1098;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1073;&#1088;&#1086;&#1081; &#1085;&#1072; &#1089;&#1098;&#1090;&#1088;&#1091;&#1076;&#1085;&#1080;&#1094;&#1080; (&#1085;&#1077; &#1087;&#1086;&#1074;&#1077;&#1095;&#1077; &#1086;&#1090;,</pre>
    <pre>MaxN,' ): ');</pre>
    <pre>readln(N);</pre>
    <pre>until (N&gt;0) AND (N&lt;=MaxN);</pre>
    <pre>For I := 1 to N do</pre>
    <pre>Begin</pre>
    <pre>Write('&#1042;&#1098;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1092;&#1072;&#1084;&#1080;&#1083;&#1085;&#1086;&#1090;&#1086; &#1080;&#1084;&#1077; &#1085;&#1072; &#1089;&#1098;&#1090;&#1088;&#1091;&#1076;&#1085;&#1080;&#1082;&#1072; &#1089; &#1085;&#1086;&#1084;&#1077;&#1088; ',I,': ');</pre>
    <pre>ReadLn(Sotr[i].FIO);</pre>
    <pre>Write('&#1042;&#1098;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1079;&#1072;&#1087;&#1083;&#1072;&#1090;&#1072;&#1090;&#1072; &#1085;&#1072; &#1089;&#1098;&#1090;&#1088;&#1091;&#1076;&#1085;&#1080;&#1082;&#1072; &#1089; &#1085;&#1086;&#1084;&#1077;&#1088; ', I, ': ');</pre>
    <pre>ReadLn(Sotr[i].O);</pre>
    <pre>Write('&#1042;&#1098;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1073;&#1088;&#1086;&#1081; &#1086;&#1090;&#1088;&#1072;&#1073;&#1086;&#1090;&#1077;&#1085;&#1080; &#1076;&#1085;&#1080; &#1089;&#1098;&#1090;&#1088;&#1091;&#1076;&#1085;&#1080;&#1082;&#1072; &#1089;</pre>
    <pre>&#1085;&#1086;&#1084;&#1077;&#1088; ', I, ': ');</pre>
    <pre>ReadLn(Sotr[i].Ko);</pre>
    <pre>End;</pre>
    <pre></pre>
    <pre>{ &#1047;&#1072;&#1087;&#1080;&#1089;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1080;&#1090;&#1077;  &#1074;&#1098;&#1074; &#1074;&#1098;&#1085;&#1096;&#1085;&#1072;&#1090;&#1072;  &#1087;&#1072;&#1084;&#1077;&#1090; }</pre>
    <pre></pre>
    <pre>Assign(F, 'MyFile.fsf');</pre>
    <pre>Rewrite(F);</pre>
    <pre>For I := 1 to N do</pre>
    <pre>Write(F, Sotr[i]);</pre>
    <pre>Close(F);</pre>
    <pre>...</pre>
    <p>
      2. &#1063;&#1077;&#1090;&#1077;&#1085;&#1077; &#1085;&#1072; &#1080;&#1079;&#1093;&#1086;&#1076;&#1085;&#1080;&#1090;&#1077; &#1076;&#1072;&#1085;&#1085;&#1080; &#1086;&#1090; &#1074;&#1098;&#1085;&#1096;&#1085;&#1072;&#1090;&#1072; &#1087;&#1072;&#1084;&#1077;&#1090;, &#1080;&#1079;&#1095;&#1080;&#1089;&#1083;&#1103;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; 
      &#1085;&#1072;&#1090;&#1088;&#1091;&#1087;&#1072;&#1085;&#1080;&#1090;&#1077; &#1089;&#1091;&#1084;&#1080; &#1080; &#1086;&#1090;&#1087;&#1077;&#1095;&#1072;&#1090;&#1074;&#1072;&#1085;&#1077;.
    </p>
    <pre>...</pre>
    <pre>{ &#1063;&#1077;&#1090;&#1077;&#1085;&#1077; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1080;&#1090;&#1077; &#1086;&#1090; &#1074;&#1098;&#1085;&#1096;&#1085;&#1072;&#1090;&#1072; &#1087;&#1072;&#1084;&#1077;&#1090;}</pre>
    <pre>Assign(F, 'MyFile.fsf');</pre>
    <pre>Reset(F);</pre>
    <pre>For I := 1 to N do</pre>
    <pre>  Read(F, Sotr[i]);</pre>
    <pre>Close(F);</pre>
    <pre>{ &#1055;&#1077;&#1095;&#1072;&#1090; &#1085;&#1072; &#1085;&#1072;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1090;&#1077; &#1089;&#1091;&#1084;&#1080; }</pre>
    <pre>For I := 1 to N do</pre>
    <pre>Begin</pre>
    <pre>  Sotr[i].S := Sotr[i].O * Sotr[i].Ko / Kr;</pre>
    <pre>  WriteLn(Sotr[i].FIO, ': ', Sotr[i].S);</pre>
    <pre>End;</pre>
    <pre>...</pre>
    <p>
      &#1055;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1077;&#1085;&#1080;&#1090;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080; &#1088;&#1077;&#1096;&#1072;&#1074;&#1072;&#1090; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1087;&#1088;&#1080; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1077;&#1085;&#1080;&#1090;&#1077; &#1076;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1085;&#1080;&#1103;. 
      &#1053;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1080;&#1090;&#1077; &#1076;&#1072;&#1085;&#1085;&#1080; &#1079;&#1072; &#1090;&#1072;&#1079;&#1080; &#1094;&#1077;&#1083; &#1089;&#1077; &#1089;&#1098;&#1093;&#1088;&#1072;&#1085;&#1103;&#1074;&#1072;&#1090; &#1074;&#1098;&#1074; &#1092;&#1072;&#1081;&#1083;&#1072; MyFile.fsf, 
      &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085; &#1089;&#1072;&#1084;&#1086; &#1079;&#1072; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1072;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1090;&#1072;&#1079;&#1080; &#1079;&#1072;&#1076;&#1072;&#1095;&#1072;. &#1048;&#1084;&#1072;&#1081;&#1090;&#1077; &#1087;&#1088;&#1077;&#1076;&#1074;&#1080;&#1076;, &#1095;&#1077; &#1074; 
      &#1090;&#1086;&#1079;&#1080; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;&#1090;&#1086; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1080;&#1090;&#1077; &#1077; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1086; &#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1072;&#1090;&#1072; &#1079;&#1072; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. 
      &#1040;&#1082;&#1086; &#1087;&#1088;&#1086;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1085;&#1072; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1080;&#1090;&#1077; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;, &#1090;&#1088;&#1103;&#1073;&#1074;&#1072; &#1076;&#1072; &#1087;&#1088;&#1086;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; 
      &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;&#1090;&#1086;. &#1055;&#1086; &#1090;&#1086;&#1079;&#1080; &#1085;&#1072;&#1095;&#1080;&#1085;, &#1089;&#1086;&#1092;&#1090;&#1091;&#1077;&#1088;&#1085;&#1072;&#1090;&#1072; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;, &#1082;&#1086;&#1103;&#1090;&#1086; &#1088;&#1077;&#1096;&#1072;&#1074;&#1072; 
      &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1077;&#1085;&#1072;&#1090;&#1072; &#1079;&#1072;&#1076;&#1072;&#1095;&#1072; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103; &#1085;&#1077;&#1081;&#1085;&#1080;&#1090;&#1077; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1080; &#1076;&#1072;&#1085;&#1085;&#1080; &#1080; &#1075;&#1080; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1080;&#1088;&#1072;. 
      &#1058;&#1072;&#1082;&#1080;&#1074;&#1072; &#1089;&#1086;&#1092;&#1090;&#1091;&#1077;&#1088;&#1085;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1080; &#1089;&#1077; &#1085;&#1072;&#1088;&#1080;&#1095;&#1072;&#1090; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1080;.
    </p>
    <p>
      &#1047;&#1072;&#1076;&#1072;&#1095;&#1072; 2. &#1057;&#1095;&#1077;&#1090;&#1086;&#1074;&#1086;&#1076;&#1077;&#1085; &#1087;&#1077;&#1088;&#1089;&#1086;&#1085;&#1072;&#1083;.
    </p>
    <p>
      &#1058;&#1091;&#1082; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1074;&#1072;&#1090;&#1077; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1079;&#1072; &#1089;&#1083;&#1091;&#1078;&#1080;&#1090;&#1077;&#1083;&#1103;, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1077;&#1085; &#1085;&#1072; &#1082;&#1072;&#1088;&#1090;&#1072;&#1090;&#1072; &#1055;&#1045;&#1056;&#1057;&#1054;&#1053;&#1040;&#1051;:
    </p>
    <table border="1" cellspacing="0" cellpadding="0" width="631">
      <tr>
        <td width="185" valign="top">
          <p>
            &#1060;&#1072;&#1084;&#1080;&#1083;&#1085;&#1086; &#1080;&#1084;&#1077;, &#1048;&#1084;&#1077;, &#1041;&#1072;&#1097;&#1080;&#1085;&#1086; &#1080;&#1084;&#1077;
          </p>
        </td>
        <td width="90" valign="top">
          <p>
            &#1044;&#1083;&#1098;&#1078;&#1085;&#1086;&#1089;&#1090;
          </p>
        </td>
        <td width="155" valign="top">
          <p>
            &#1043;&#1086;&#1076;&#1080;&#1085;&#1072; &#1085;&#1072; &#1088;&#1072;&#1078;&#1076;&#1072;&#1085;&#1077;
          </p>
        </td>
        <td width="76" valign="top">
          <p>
            &#1047;&#1072;&#1087;&#1083;&#1072;&#1090;&#1072;
          </p>
        </td>
        <td width="125" valign="top">
          <p>
            &#1052;&#1103;&#1089;&#1090;&#1086; &#1085;&#1072; &#1087;&#1088;&#1077;&#1073;&#1080;&#1074;&#1072;&#1074;&#1072;&#1085;&#1077;
          </p>
        </td>
      </tr>
      <tr>
        <td width="185" valign="top">
          <p align="center">
            FIO
          </p>
        </td>
        <td width="90" valign="top">
          <p align="center">
            D
          </p>
        </td>
        <td width="155" valign="top">
          <p align="center">
            G
          </p>
        </td>
        <td width="76" valign="top">
          <p align="center">
            O
          </p>
        </td>
        <td width="125" valign="top">
          <p align="center">
            M
          </p>
        </td>
      </tr>
    </table>
    <p>
      &#1056;&#1077;&#1096;&#1072;&#1074;&#1072;&#1085;&#1077;&#1090;&#1086; &#1085;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1089;&#1077; &#1089;&#1098;&#1089;&#1090;&#1086;&#1080; &#1086;&#1090; &#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1090;&#1077; &#1077;&#1090;&#1072;&#1087;&#1080;:
    </p>
    <p>
      &#1042;&#1098;&#1074;&#1077;&#1078;&#1076;&#1072;&#1085;&#1077; &#1085;&#1072; &#1087;&#1098;&#1088;&#1074;&#1086;&#1085;&#1072;&#1095;&#1072;&#1083;&#1085;&#1080;&#1090;&#1077; &#1076;&#1072;&#1085;&#1085;&#1080; &#1080; &#1074;&#1098;&#1074;&#1077;&#1078;&#1076;&#1072;&#1085;&#1077;&#1090;&#1086; &#1080;&#1084; &#1074; &#1074;&#1098;&#1085;&#1096;&#1085;&#1072;&#1090;&#1072; &#1087;&#1072;&#1084;&#1077;&#1090;.
    </p>
    <p>
      &#1063;&#1077;&#1090;&#1077;&#1085;&#1077; &#1085;&#1072; &#1080;&#1079;&#1093;&#1086;&#1076;&#1085;&#1080;&#1090;&#1077; &#1076;&#1072;&#1085;&#1085;&#1080; &#1086;&#1090; &#1074;&#1098;&#1085;&#1096;&#1085;&#1072;&#1090;&#1072; &#1087;&#1072;&#1084;&#1077;&#1090;, &#1079;&#1072; &#1076;&#1072; &#1089;&#1077; &#1080;&#1079;&#1090;&#1088;&#1080;&#1077;, &#1082;&#1086;&#1088;&#1080;&#1075;&#1080;&#1088;&#1072; 
      &#1080;&#1083;&#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080; &#1079;&#1072;&#1087;&#1080;&#1089;.
    </p>
    <pre>...</pre>
    <pre>{ &#1063;&#1077;&#1090;&#1077;&#1085;&#1077; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1080;&#1090;&#1077; &#1086;&#1090; &#1074;&#1098;&#1085;&#1096;&#1085;&#1072;&#1090;&#1072; &#1087;&#1072;&#1084;&#1077;&#1090; }</pre>
    <pre>Assign(F, 'MyFile.fsf');</pre>
    <pre>Reset(F);</pre>
    <pre>IsFound := False;</pre>
    <pre>For I := 1 to N do</pre>
    <pre>Begin</pre>
    <pre>  Read(F, Sotr);</pre>
    <pre>  If Sotr.FIO = KeyFio Then</pre>
    <pre>  Begin</pre>
    <pre>          IsFound := True;</pre>
    <pre>          Sotr.D := '&#1053;&#1072;&#1095;&#1072;&#1083;&#1085;&#1080;&#1082; &#1085;&#1072; &#1086;&#1090;&#1076;&#1077;&#1083;&#1072;';</pre>
    <pre>          Seek(F, FilePos(F)-1);</pre>
    <pre>          Write(F, Sotr);</pre>
    <pre>          Break;</pre>
    <pre>  End;</pre>
    <pre>If IsFound Then </pre>
    <pre>WriteLn('&#1055;&#1088;&#1086;&#1084;&#1103;&#1085;&#1072;&#1090;&#1072; &#1077; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1072;')</pre>
    <pre>Else WriteLn('&#1057;&#1098;&#1090;&#1088;&#1091;&#1076;&#1085;&#1080;&#1082;', KeyFio, '&#1085;&#1077; &#1077; &#1085;&#1072;&#1084;&#1077;&#1088;&#1077;&#1085;');</pre>
    <pre>Close(F);</pre>
    <pre>...</pre>
    <p>
      &#1042; &#1088;&#1072;&#1079;&#1075;&#1083;&#1077;&#1078;&#1076;&#1072;&#1085;&#1080;&#1103; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081; &#1055;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; 2 &#1089;&#1077; &#1088;&#1077;&#1096;&#1072;&#1074;&#1072; &#1085;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086; &#1086;&#1090; &#1055;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; 1.
    </p>
    <p>
      &#1047;&#1072;&#1076;&#1072;&#1095;&#1072; 3. &#1054;&#1089;&#1095;&#1077;&#1090;&#1086;&#1074;&#1086;&#1076;&#1103;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1089;&#1087;&#1077;&#1089;&#1090;&#1103;&#1074;&#1072;&#1085;&#1077;&#1090;&#1086; &#1085;&#1072; &#1092;&#1086;&#1085;&#1076; &#1079;&#1072; &#1079;&#1072;&#1087;&#1083;&#1072;&#1090;&#1080; (FOT) &#1074;&#1098;&#1074; 
      &#1074;&#1088;&#1098;&#1079;&#1082;&#1072; &#1089;&#1098;&#1089; &#1079;&#1072;&#1073;&#1086;&#1083;&#1103;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1089;&#1083;&#1091;&#1078;&#1080;&#1090;&#1077;&#1083;&#1080;&#1090;&#1077;.
    </p>
    <p>
      &#1048;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;&#1090;&#1072;, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1077;&#1085;&#1072; &#1086;&#1090; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;&#1090;&#1077;, &#1089;&#1077; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1074;&#1072;. &#1048;&#1050;&#1054;&#1053;&#1054;&#1052;&#1048;&#1050;&#1040; &#1053;&#1040; &#1060;&#1054;&#1058;:
    </p>
    <table border="1" cellspacing="0" cellpadding="0" width="631">
      <tr>
        <td width="243" valign="top">
          <p>
            &#1060;&#1072;&#1084;&#1080;&#1083;&#1085;&#1086; &#1080;&#1084;&#1077;, &#1048;&#1084;&#1077;, &#1041;&#1072;&#1097;&#1080;&#1085;&#1086; &#1080;&#1084;&#1077;
          </p>
        </td>
        <td width="76" valign="top">
          <p align="center">
            &#1047;&#1072;&#1087;&#1083;&#1072;&#1090;&#1072;
          </p>
        </td>
        <td width="156" valign="top">
          <p align="center">
            &#1041;&#1088;&#1086;&#1081; &#1076;&#1085;&#1080; &#1074; &#1083;&#1080;&#1089;&#1090;&#1072; &#1079;&#1072; &#1086;&#1090;&#1087;&#1091;&#1089;&#1082; &#1087;&#1086; &#1073;&#1086;&#1083;&#1077;&#1089;&#1090;
          </p>
        </td>
        <td width="156" valign="top">
          <p align="center">
            &#1053;&#1077;&#1087;&#1083;&#1072;&#1090;&#1077;&#1085;&#1072; &#1089;&#1091;&#1084;&#1072;
          </p>
        </td>
      </tr>
      <tr>
        <td width="243" valign="top">
          <p align="center">
            FIO
          </p>
        </td>
        <td width="76" valign="top">
          <p align="center">
            O
          </p>
        </td>
        <td width="156" valign="top">
          <p align="center">
            K<sub>&#1076;&#1074;</sub>
          </p>
        </td>
        <td width="156" valign="top">
          <p align="center">
            SN
          </p>
        </td>
      </tr>
    </table>
    <pre></pre>
    <pre>SN=K<sub>&#1076;&#1074;</sub>O/K<sub>r</sub>.</pre>
    <p>
      &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1072;&#1090;&#1072; &#1079;&#1072; &#1088;&#1077;&#1096;&#1072;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; 3 &#1077; &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1072; &#1085;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1072;&#1090;&#1072; &#1079;&#1072; &#1088;&#1077;&#1096;&#1072;&#1074;&#1072;&#1085;&#1077; 
      &#1085;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; 1.
    </p>
    <p>
      &#1044;&#1072; &#1088;&#1072;&#1079;&#1075;&#1083;&#1077;&#1076;&#1072;&#1084;&#1077; &#1090;&#1080;&#1087;&#1080;&#1095;&#1085;&#1080;&#1103; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081;, &#1082;&#1086;&#1075;&#1072;&#1090;&#1086; &#1080; &#1090;&#1088;&#1080;&#1090;&#1077; &#1089;&#1087;&#1086;&#1084;&#1077;&#1085;&#1072;&#1090;&#1080; &#1087;&#1086;-&#1075;&#1086;&#1088;&#1077; 
      &#1089;&#1086;&#1092;&#1090;&#1091;&#1077;&#1088;&#1085;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1072;&#1090; &#1074; &#1077;&#1076;&#1085;&#1072; &#1080; &#1089;&#1098;&#1097;&#1072; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103;. &#1054;&#1090;&#1073;&#1077;&#1083;&#1103;&#1079;&#1074;&#1072;&#1084;&#1077; 
      &#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1090;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1080; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1098;&#1094;&#1080;:
    </p>
    <p>
      &#1048;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;&#1090;&#1072; &#1089;&#1077; &#1076;&#1091;&#1073;&#1083;&#1080;&#1088;&#1072;. &#1042; &#1090;&#1088;&#1080; &#1092;&#1072;&#1081;&#1083;&#1072; &#1080;&#1084;&#1072; &#1087;&#1086;&#1083;&#1077;&#1090;&#1072; FIO, O, &#1082;&#1086;&#1077;&#1090;&#1086; &#1074;&#1086;&#1076;&#1080; &#1076;&#1086; 
      &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1085;&#1086; &#1087;&#1088;&#1077;&#1074;&#1080;&#1096;&#1072;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1087;&#1072;&#1084;&#1077;&#1090;&#1090;&#1072;. &#1050;&#1086;&#1075;&#1072;&#1090;&#1086; &#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1077; &#1087;&#1088;&#1086;&#1084;&#1077;&#1085;&#1080; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; 
      &#1087;&#1088;&#1086;&#1084;&#1103;&#1085;&#1072; &#1085;&#1072; &#1092;&#1072;&#1084;&#1080;&#1083;&#1085;&#1086;&#1090;&#1086; &#1080;&#1084;&#1077;), &#1090;&#1088;&#1103;&#1073;&#1074;&#1072; &#1076;&#1072; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1077; &#1077;&#1076;&#1085;&#1072; &#1080; &#1089;&#1098;&#1097;&#1072; &#1089;&#1090;&#1086;&#1081;&#1085;&#1086;&#1089;&#1090; 
      &#1085;&#1103;&#1082;&#1086;&#1083;&#1082;&#1086; &#1087;&#1098;&#1090;&#1080; &#1074; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1080;&#1090;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1077;, &#1082;&#1086;&#1077;&#1090;&#1086; &#1074;&#1086;&#1076;&#1080; &#1076;&#1086; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1072;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; 
      &#1088;&#1072;&#1079;&#1093;&#1086;&#1076;&#1080;&#1090;&#1077; &#1079;&#1072; &#1082;&#1086;&#1084;&#1087;&#1102;&#1090;&#1098;&#1088;&#1085;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;. &#1042;&#1098;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1077; &#1085;&#1077;&#1089;&#1098;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1077; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1080;&#1090;&#1077; 
      (&#1077;&#1076;&#1085;&#1072; &#1087;&#1088;&#1086;&#1084;&#1103;&#1085;&#1072; &#1077; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1077;&#1085;&#1072; &#1074;&#1098;&#1074; &#1092;&#1072;&#1081;&#1083;&#1072;, &#1076;&#1088;&#1091;&#1075;&#1080;&#1103;&#1090; &#1092;&#1072;&#1081;&#1083; &#1085;&#1077; &#1077; &#1073;&#1080;&#1083;).
    </p>
    <p>
      &#1055;&#1088;&#1077;&#1084;&#1072;&#1093;&#1074;&#1072;&#1085;&#1077;&#1090;&#1086; &#1085;&#1072; &#1090;&#1077;&#1079;&#1080; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1098;&#1094;&#1080; &#1084;&#1086;&#1078;&#1077; &#1076;&#1072; &#1073;&#1098;&#1076;&#1077;, &#1082;&#1072;&#1090;&#1086; &#1089;&#1077; &#1089;&#1098;&#1095;&#1077;&#1090;&#1072;&#1103;&#1090; 
      &#1089;&#1098;&#1086;&#1090;&#1074;&#1077;&#1090;&#1085;&#1080;&#1090;&#1077; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1080; &#1089;&#1077; &#1089;&#1098;&#1079;&#1076;&#1072;&#1076;&#1077; &#1077;&#1076;&#1080;&#1085;&#1085;&#1072; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1072; &#1073;&#1072;&#1079;&#1072; &#1079;&#1072; &#1074;&#1089;&#1080;&#1095;&#1082;&#1080; 
      &#1087;&#1086;-&#1075;&#1086;&#1088;&#1077; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080;. &#1053;&#1072; &#1087;&#1088;&#1098;&#1074; &#1087;&#1086;&#1075;&#1083;&#1077;&#1076; &#1077; &#1089;&#1098;&#1074;&#1089;&#1077;&#1084; &#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1086; &#1076;&#1072; &#1089;&#1077; &#1089;&#1083;&#1077;&#1103;&#1090; &#1074;&#1089;&#1080;&#1095;&#1082;&#1080; 
      &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1074; &#1077;&#1076;&#1085;&#1086;, &#1082;&#1072;&#1090;&#1086; &#1089;&#1077; &#1087;&#1088;&#1077;&#1084;&#1072;&#1093;&#1085;&#1072;&#1090; &#1076;&#1091;&#1073;&#1083;&#1080;&#1088;&#1072;&#1085;&#1080;&#1090;&#1077; &#1087;&#1086;&#1083;&#1077;&#1090;&#1072;. &#1055;&#1086;&#1083;&#1091;&#1095;&#1072;&#1074;&#1072;&#1084;&#1077; 
      &#1074;&#1098;&#1079;&#1084;&#1086;&#1078;&#1085;&#1072;&#1090;&#1072; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; &#1085;&#1072; &#1089;&#1083;&#1080;&#1074;&#1072;&#1085;&#1077;&#1090;&#1086;:
    </p>
    <p>
      FIO D O G K<sub>o </sub>M K<sub>&#1076;&#1074; </sub>S SN
    </p>
    <p>
      &#1044;&#1091;&#1073;&#1083;&#1080;&#1088;&#1072;&#1085;&#1077;&#1090;&#1086; &#1085;&#1072; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;&#1090;&#1072; &#1077; &#1085;&#1072;&#1087;&#1098;&#1083;&#1085;&#1086; &#1087;&#1088;&#1077;&#1084;&#1072;&#1093;&#1085;&#1072;&#1090;&#1086;. &#1050;&#1086;&#1085;&#1089;&#1091;&#1084;&#1072;&#1094;&#1080;&#1103;&#1090;&#1072; &#1085;&#1072; &#1087;&#1072;&#1084;&#1077;&#1090; 
      &#1077; &#1084;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1085;&#1072;. &#1053;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1098;&#1094;&#1080;&#1090;&#1077; &#1089;&#1072; &#1077;&#1083;&#1080;&#1084;&#1080;&#1085;&#1080;&#1088;&#1072;&#1085;&#1080;. &#1053;&#1077;&#1082;&#1072; &#1076;&#1072; &#1088;&#1072;&#1079;&#1075;&#1083;&#1077;&#1076;&#1072;&#1084;&#1077; &#1082;&#1072;&#1082; &#1074; &#1090;&#1086;&#1079;&#1080; 
      &#1089;&#1083;&#1091;&#1095;&#1072;&#1081; &#1074;&#1088;&#1077;&#1084;&#1077;&#1090;&#1086; &#1079;&#1072; &#1088;&#1077;&#1096;&#1072;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1080;&#1090;&#1077; 1-3 &#1097;&#1077; &#1089;&#1077; &#1087;&#1088;&#1086;&#1084;&#1077;&#1085;&#1080;. &#1042;&#1088;&#1077;&#1084;&#1077;&#1090;&#1086; &#1079;&#1072; 
      &#1088;&#1077;&#1096;&#1072;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1077; &#1087;&#1088;&#1103;&#1082;&#1086; &#1087;&#1088;&#1086;&#1087;&#1086;&#1088;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1085;&#1086; &#1085;&#1072; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;&#1090;&#1086; &#1076;&#1072;&#1085;&#1085;&#1080;, 
      &#1095;&#1077;&#1090;&#1077;&#1085;&#1080; &#1086;&#1090; &#1074;&#1098;&#1085;&#1096;&#1085;&#1072;&#1090;&#1072; &#1087;&#1072;&#1084;&#1077;&#1090;.
    </p>
    <p>
      &#1055;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1074;&#1072;&#1084;&#1077; Ti, li, Ni &#1076;&#1072; &#1073;&#1098;&#1076;&#1077; &#1074;&#1088;&#1077;&#1084;&#1077;&#1090;&#1086; &#1079;&#1072; &#1074;&#1079;&#1077;&#1084;&#1072;&#1085;&#1077; &#1085;&#1072; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;, &#1076;&#1098;&#1083;&#1078;&#1080;&#1085;&#1072;&#1090;&#1072; 
      &#1085;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;, &#1073;&#1088;&#1086;&#1103; &#1085;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;&#1090;&#1077; &#1085;&#1072; i-&#1090;&#1080;&#1103; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; (i = 1, 2, 3), &#1089;&#1098;&#1086;&#1090;&#1074;&#1077;&#1090;&#1085;&#1086;, 
      &#1082;&#1086;&#1075;&#1072;&#1090;&#1086; &#1089;&#1077; &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072;&#1090; &#1086;&#1090;&#1076;&#1077;&#1083;&#1085;&#1080; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1077; &#1079;&#1072; &#1074;&#1089;&#1103;&#1082;&#1072; &#1079;&#1072;&#1076;&#1072;&#1095;&#1072;:
    </p>
    <p align="center">
      <img width="164" height="22" src="file:/C:/Users/Admin/Documents/NetBeansProjects/SQLTrainingExampl/src/res/Lecture/Admin/Resources/3.JPG" alt="T_{i}\approx C \times l_{i} \times N_{i}">
      
    </p>
    <p>
      &#1082;&#1098;&#1076;&#1077;&#1090;&#1086; C &#1077; &#1085;&#1103;&#1082;&#1072;&#1082;&#1098;&#1074; &#1082;&#1086;&#1077;&#1092;&#1080;&#1094;&#1080;&#1077;&#1085;&#1090; &#1085;&#1072; &#1087;&#1088;&#1086;&#1087;&#1086;&#1088;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1085;&#1086;&#1089;&#1090;.
    </p>
    <p>
      &#1054;&#1090;&#1073;&#1077;&#1083;&#1077;&#1078;&#1077;&#1090;&#1077; &#1089;&#1098;&#1086;&#1090;&#1074;&#1077;&#1090;&#1085;&#1086; Ri, d, N, &#1074;&#1088;&#1077;&#1084;&#1077;&#1090;&#1086; &#1079;&#1072; &#1088;&#1077;&#1096;&#1072;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; i-&#1090;&#1080;&#1103; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; (i = 
      1, 2, 3), &#1082;&#1086;&#1075;&#1072;&#1090;&#1086; &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072;&#1084;&#1077; &#1092;&#1072;&#1081;&#1083;&#1072; &#1089; &#1086;&#1073;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;, &#1076;&#1098;&#1083;&#1078;&#1080;&#1085;&#1072;&#1090;&#1072; &#1085;&#1072; 
      &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;, &#1073;&#1088;&#1086;&#1103; &#1085;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;&#1090;&#1077;:
    </p>
    <p align="center">
      <img width="163" height="22" src="file:/C:/Users/Admin/Documents/NetBeansProjects/SQLTrainingExampl/src/res/Lecture/Admin/Resources/4.JPG" alt="R_{i}\approx C \times d \times N">
      
    </p>
    <p>
      &#1047;&#1072;&#1073;&#1077;&#1083;&#1077;&#1078;&#1077;&#1090;&#1077;, &#1095;&#1077; N1 = N2 = N, N3 &lt;&lt; N.
    </p>
    <p>
      &#1057;&#1083;&#1077;&#1076; &#1090;&#1086;&#1074;&#1072; &#1074;&#1088;&#1077;&#1084;&#1077;&#1090;&#1086; &#1079;&#1072; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; i-&#1090;&#1080;&#1103; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; (i = 1, 2) &#1087;&#1088;&#1080; &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072;&#1085;&#1077; 
      &#1085;&#1072; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1080;&#1088;&#1072;&#1085;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083; &#1097;&#1077; &#1089;&#1077; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080; <img width="123" height="26" src="file:/C:/Users/Admin/Documents/NetBeansProjects/SQLTrainingExampl/src/res/Lecture/Admin/Resources/5.JPG" alt="R_{i}/T_{i}\approx d/l_{i}"> 
      &#1087;&#1098;&#1090;. &#1047;&#1072; &#1085;&#1072;&#1096;&#1080;&#1103; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074;&#1088;&#1077;&#1084;&#1077;&#1090;&#1086; &#1079;&#1072; &#1088;&#1077;&#1096;&#1072;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1080; &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090; &#1086;&#1090; 
      &#1080;&#1079;&#1073;&#1088;&#1072;&#1085;&#1072;&#1090;&#1072; &#1076;&#1098;&#1083;&#1078;&#1080;&#1085;&#1072; &#1085;&#1072; &#1087;&#1086;&#1083;&#1077;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077; &#1076;&#1072; &#1073;&#1098;&#1076;&#1077; &#1087;&#1088;&#1086;&#1084;&#1077;&#1085;&#1077;&#1085;&#1086; 2-3 &#1087;&#1098;&#1090;&#1080;. &#1055;&#1086; &#1090;&#1086;&#1079;&#1080; 
      &#1085;&#1072;&#1095;&#1080;&#1085; &#1087;&#1083;&#1072;&#1097;&#1072;&#1085;&#1077;&#1090;&#1086; &#1079;&#1072; &#1087;&#1088;&#1077;&#1084;&#1072;&#1093;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1076;&#1091;&#1073;&#1083;&#1080;&#1088;&#1072;&#1085;&#1077;&#1090;&#1086; &#1085;&#1072; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1077; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; 
      &#1085;&#1072; &#1074;&#1088;&#1077;&#1084;&#1077;&#1090;&#1086; &#1079;&#1072; &#1088;&#1077;&#1096;&#1072;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080;&#1090;&#1077;. &#1054;&#1073;&#1098;&#1088;&#1085;&#1077;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1077; &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1086; 
      &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086; &#1077; &#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1086;. &#1042;&#1088;&#1077;&#1084;&#1077;&#1090;&#1086; &#1079;&#1072; &#1088;&#1077;&#1096;&#1072;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; 3 &#1097;&#1077; 
      &#1089;&#1077; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080; <img width="246" height="26" src="file:/C:/Users/Admin/Documents/NetBeansProjects/SQLTrainingExampl/src/res/Lecture/Admin/Resources/6.JPG" alt="R3/T3\approx d \times N/l3 \times N3"> 
      &#1087;&#1098;&#1090;. &#1058;&#1098;&#1081; &#1082;&#1072;&#1090;&#1086; &#1079;&#1072; &#1090;&#1086;&#1079;&#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; N3 &lt;&lt; N, &#1090;&#1086;&#1075;&#1072;&#1074;&#1072; R3 &gt;&gt; T3. &#1042;&#1088;&#1077;&#1084;&#1077;&#1090;&#1086; &#1079;&#1072; 
      &#1088;&#1077;&#1096;&#1072;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; 3 &#1084;&#1086;&#1078;&#1077; &#1076;&#1072; &#1089;&#1077; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080; &#1089; &#1085;&#1103;&#1082;&#1086;&#1083;&#1082;&#1086; &#1087;&#1086;&#1088;&#1098;&#1095;&#1082;&#1080;, &#1082;&#1086;&#1077;&#1090;&#1086; &#1077; 
      &#1085;&#1072;&#1087;&#1098;&#1083;&#1085;&#1086; &#1085;&#1077;&#1087;&#1088;&#1080;&#1077;&#1084;&#1083;&#1080;&#1074;&#1086;.
    </p>
    <p>
      &#1044;&#1072; &#1088;&#1072;&#1079;&#1075;&#1083;&#1077;&#1076;&#1072;&#1084;&#1077; &#1076;&#1088;&#1091;&#1075; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; &#1085;&#1072; &#1080;&#1079;&#1075;&#1088;&#1072;&#1078;&#1076;&#1072;&#1085;&#1077; &#1085;&#1072; &#1077;&#1076;&#1080;&#1085;&#1085;&#1072; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1072; &#1073;&#1072;&#1079;&#1072;. 
      &#1053;&#1080;&#1077; &#1086;&#1073;&#1077;&#1076;&#1080;&#1085;&#1103;&#1074;&#1072;&#1084;&#1077; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;&#1090;&#1077; &#1085;&#1072; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; 1 &#1080; 2, &#1086;&#1089;&#1090;&#1072;&#1074;&#1103;&#1084;&#1077; &#1079;&#1072;&#1076;&#1072;&#1095;&#1072;&#1090;&#1072; 3 &#1079;&#1072;&#1087;&#1080;&#1089; 
      &#1086;&#1090;&#1076;&#1077;&#1083;&#1085;&#1086;. &#1055;&#1086;&#1083;&#1091;&#1095;&#1072;&#1074;&#1072;&#1084;&#1077; &#1076;&#1074;&#1072; &#1090;&#1080;&#1087;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;:
    </p>
    <table border="0" cellspacing="1" cellpadding="0">
      <tr>
        <td valign="top">
          <p>
            FIO
          </p>
        </td>
        <td valign="top">
          <p>
            D
          </p>
        </td>
        <td valign="top">
          <p>
            O
          </p>
        </td>
        <td colspan="2" valign="top">
          <p>
            G
          </p>
        </td>
        <td valign="top">
          <p>
            K<sub>o</sub>
          </p>
        </td>
        <td colspan="2" valign="top">
          <p>
            S
          </p>
        </td>
        <td valign="top">
          <p>
            M
          </p>
        </td>
      </tr>
      <tr>
        <td valign="top">
          <p>
            <a name="table.">
</a>FIO
          </p>
        </td>
        <td valign="top">
          <p>
            O
          </p>
        </td>
        <td colspan="2" valign="top">
          <p>
            K<sub>&#1076;&#1074;</sub>
          </p>
        </td>
        <td colspan="3" valign="top">
          <p>
            SN
          </p>
        </td>
      </tr>
      <tr height="0">
        <td width="93">
          
        </td>
        <td width="75">
          
        </td>
        <td width="75">
          
        </td>
        <td width="37">
          
        </td>
        <td width="37">
          
        </td>
        <td width="81">
          
        </td>
        <td width="36">
          
        </td>
        <td width="36">
          
        </td>
        <td width="78">
          
        </td>
      </tr>
    </table>
    <p>
      &#1042; &#1090;&#1086;&#1079;&#1080; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081; &#1076;&#1091;&#1073;&#1083;&#1080;&#1088;&#1072;&#1085;&#1077;&#1090;&#1086; &#1086;&#1089;&#1090;&#1072;&#1074;&#1072; (&#1087;&#1086;&#1083;&#1077;&#1090;&#1072;&#1090;&#1072; FIO, O &#1089;&#1077; &#1076;&#1091;&#1073;&#1083;&#1080;&#1088;&#1072;&#1090;). &#1053;&#1086; &#1090;&#1098;&#1081; 
      &#1082;&#1072;&#1090;&#1086; N3 &lt;&lt; N, &#1086;&#1073;&#1097;&#1086;&#1090;&#1086; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1076;&#1091;&#1073;&#1083;&#1080;&#1088;&#1072;&#1085;&#1077; &#1077; &#1085;&#1077;&#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1085;&#1086;. &#1042;&#1088;&#1077;&#1084;&#1077;&#1090;&#1086; &#1079;&#1072; 
      &#1088;&#1077;&#1096;&#1072;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; 1 &#1080; 2 &#1074; &#1090;&#1086;&#1079;&#1080; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081; &#1097;&#1077; &#1089;&#1077; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080; &#1085;&#1077;&#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1085;&#1086; &#1074; 
      &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1077; &#1089; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1072; &#1085;&#1072; &#1086;&#1090;&#1076;&#1077;&#1083;&#1085;&#1080; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1080;, &#1074;&#1088;&#1077;&#1084;&#1077;&#1090;&#1086; &#1079;&#1072; &#1088;&#1077;&#1096;&#1072;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; 
      &#1079;&#1072;&#1076;&#1072;&#1095;&#1072; 3 &#1077; &#1089;&#1098;&#1097;&#1086;&#1090;&#1086; &#1082;&#1072;&#1090;&#1086; &#1074; &#1087;&#1098;&#1088;&#1074;&#1086;&#1085;&#1072;&#1095;&#1072;&#1083;&#1085;&#1072;&#1090;&#1072; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; &#1085;&#1072; &#1086;&#1090;&#1076;&#1077;&#1083;&#1077;&#1085; &#1092;&#1072;&#1081;&#1083;. &#1058;&#1072;&#1082;&#1072;&#1074;&#1072; 
      &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1103; &#1084;&#1086;&#1078;&#1077; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1085;&#1086; &#1076;&#1072; &#1085;&#1072;&#1084;&#1072;&#1083;&#1080; &#1074;&#1098;&#1079;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;&#1090;&#1086; &#1085;&#1072; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1098;&#1094;&#1080;&#1090;&#1077; &#1080; &#1074; 
      &#1089;&#1098;&#1097;&#1086;&#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1085;&#1086; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1072;&#1074;&#1072; &#1074;&#1088;&#1077;&#1084;&#1077;&#1090;&#1086; &#1079;&#1072; &#1088;&#1077;&#1096;&#1072;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1074;&#1089;&#1080;&#1095;&#1082;&#1080; 
      &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1080;. &#1048; &#1090;&#1088;&#1080;&#1090;&#1077; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; &#1084;&#1086;&#1075;&#1072;&#1090; &#1076;&#1072; &#1073;&#1098;&#1076;&#1072;&#1090; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1090;&#1072; &#1085;&#1072; &#1086;&#1073;&#1097;&#1072; 
      &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1072; &#1073;&#1072;&#1079;&#1072; &#1086;&#1090; &#1076;&#1074;&#1072; &#1090;&#1080;&#1087;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;. &#1054;&#1073;&#1098;&#1088;&#1085;&#1077;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1077; &#1076;&#1074;&#1072;&#1090;&#1072; 
      &#1080;&#1079;&#1073;&#1088;&#1086;&#1077;&#1085;&#1080; &#1090;&#1080;&#1087;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1089;&#1072; &#1089;&#1074;&#1098;&#1088;&#1079;&#1072;&#1085;&#1080; &#1087;&#1086;&#1084;&#1077;&#1078;&#1076;&#1091; &#1089;&#1080; &#1087;&#1086; &#1087;&#1086;&#1083;&#1077;&#1090;&#1086; FIO (&#1074; &#1085;&#1103;&#1082;&#1086;&#1080; 
      &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1103;). &#1048;&#1084;&#1072;&#1081;&#1090;&#1077; &#1087;&#1088;&#1077;&#1076;&#1074;&#1080;&#1076;, &#1095;&#1077; &#1075;&#1086;&#1088;&#1077;&#1087;&#1086;&#1089;&#1086;&#1095;&#1077;&#1085;&#1080;&#1090;&#1077; &#1080;&#1085;&#1090;&#1077;&#1075;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1080; &#1086;&#1087;&#1094;&#1080;&#1080; &#1085;&#1077; 
      &#1080;&#1079;&#1095;&#1077;&#1088;&#1087;&#1074;&#1072;&#1090; &#1074;&#1089;&#1080;&#1095;&#1082;&#1080; &#1074;&#1098;&#1079;&#1084;&#1086;&#1078;&#1085;&#1080; &#1085;&#1072;&#1095;&#1080;&#1085;&#1080; &#1079;&#1072; &#1080;&#1085;&#1090;&#1077;&#1075;&#1088;&#1080;&#1088;&#1072;&#1085;&#1077; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1080;&#1090;&#1077; &#1079;&#1072; &#1076;&#1072;&#1076;&#1077;&#1085;&#1080;&#1090;&#1077; 
      &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1080; &#1080; &#1097;&#1077; &#1089;&#1077; &#1074;&#1098;&#1088;&#1085;&#1077;&#1084; &#1082;&#1098;&#1084; &#1074;&#1098;&#1087;&#1088;&#1086;&#1089;&#1072; &#1079;&#1072; &#1080;&#1079;&#1073;&#1086;&#1088;&#1072; &#1085;&#1072; &#1085;&#1072;&#1081;-&#1076;&#1086;&#1073;&#1088;&#1080;&#1103; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; &#1074; 
      &#1089;&#1083;&#1077;&#1076;&#1074;&#1072;&#1097;&#1080;&#1090;&#1077; &#1083;&#1077;&#1082;&#1094;&#1080;&#1080;.
    </p>
    <p>
      &#1058;&#1091;&#1082; &#1077; &#1084;&#1085;&#1086;&#1075;&#1086; &#1074;&#1072;&#1078;&#1085;&#1086; &#1074; &#1090;&#1086;&#1079;&#1080; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081; &#1076;&#1072; &#1089;&#1077; &#1088;&#1077;&#1096;&#1072;&#1090; &#1075;&#1086;&#1088;&#1085;&#1080;&#1090;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1080;, &#1089;&#1077; 
      &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072; &#1085;&#1086;&#1074; &#1074;&#1080;&#1076; &#1076;&#1072;&#1085;&#1085;&#1080;, &#1092;&#1086;&#1088;&#1084;&#1080;&#1088;&#1072;&#1085;&#1080; &#1074;&#1098;&#1079; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072; &#1085;&#1072; &#1080;&#1085;&#1090;&#1077;&#1075;&#1088;&#1080;&#1088;&#1072;&#1085;&#1077;&#1090;&#1086; &#1085;&#1072; 
      &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;&#1090;&#1077;.
    </p>
    <p>
      &#1047;&#1072; &#1076;&#1072; &#1089;&#1077; &#1086;&#1087;&#1080;&#1096;&#1077; &#1090;&#1086;&#1079;&#1080; &#1090;&#1080;&#1087; &#1076;&#1072;&#1085;&#1085;&#1080;, &#1089;&#1077; &#1074;&#1098;&#1074;&#1077;&#1078;&#1076;&#1072; &#1085;&#1086;&#1074;&#1072; &#1082;&#1086;&#1085;&#1094;&#1077;&#1087;&#1094;&#1080;&#1103; &quot;&#1041;&#1072;&#1079;&#1072; &#1076;&#1072;&#1085;&#1085;&#1080;&quot;.
    </p>
    <p>
      &#1041;&#1072;&#1079;&#1072; &#1076;&#1072;&#1085;&#1085;&#1080; - &#1082;&#1086;&#1083;&#1077;&#1082;&#1094;&#1080;&#1103; &#1086;&#1090; &#1082;&#1086;&#1087;&#1080;&#1103; &#1085;&#1072; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1080; &#1074;&#1080;&#1076;&#1086;&#1074;&#1077; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1080; &#1074;&#1088;&#1098;&#1079;&#1082;&#1080; &#1084;&#1077;&#1078;&#1076;&#1091; 
      &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1080; &#1077;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1080;.
    </p>
    <p>
      &#1041;&#1072;&#1079;&#1072;&#1090;&#1072; &#1076;&#1072;&#1085;&#1085;&#1080; &#1084;&#1086;&#1078;&#1077; &#1076;&#1072; &#1073;&#1098;&#1076;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1072; &#1082;&#1072;&#1090;&#1086; &#1089;&#1098;&#1074;&#1082;&#1091;&#1087;&#1085;&#1086;&#1089;&#1090; &#1086;&#1090; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1089;&#1074;&#1098;&#1088;&#1079;&#1072;&#1085;&#1080; 
      &#1076;&#1072;&#1085;&#1085;&#1080;, &#1089;&#1098;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080; &#1079;&#1072;&#1077;&#1076;&#1085;&#1086; &#1087;&#1088;&#1080; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1077;&#1090;&#1086; &#1085;&#1072; &#1090;&#1072;&#1082;&#1086;&#1074;&#1072; &#1084;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1085;&#1086; &#1080;&#1079;&#1083;&#1080;&#1096;&#1098;&#1082;, &#1082;&#1086;&#1077;&#1090;&#1086; 
      &#1080;&#1084; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1074;&#1072; &#1076;&#1072; &#1073;&#1098;&#1076;&#1072;&#1090; &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072;&#1085;&#1080; &#1086;&#1087;&#1090;&#1080;&#1084;&#1072;&#1083;&#1085;&#1086; &#1079;&#1072; &#1077;&#1076;&#1085;&#1086; &#1080;&#1083;&#1080; &#1087;&#1086;&#1074;&#1077;&#1095;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;.
    </p>
    <p>
      &#1055;&#1086; &#1090;&#1086;&#1079;&#1080; &#1085;&#1072;&#1095;&#1080;&#1085; &#1074;&#1098;&#1079;&#1085;&#1080;&#1082;&#1074;&#1072;&#1085;&#1077;&#1090;&#1086; &#1085;&#1072; &#1087;&#1086;&#1085;&#1103;&#1090;&#1080;&#1077;&#1090;&#1086; &quot;&#1041;&#1072;&#1079;&#1080; &#1076;&#1072;&#1085;&#1085;&#1080;&quot; &#1089;&#1077; &#1076;&#1098;&#1083;&#1078;&#1080; &#1085;&#1072; &#1087;&#1086;&#1103;&#1074;&#1072;&#1090;&#1072; 
      &#1085;&#1072; &#1085;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089; &#1085;&#1077;-&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1080;, &#1074; &#1095;&#1080;&#1077;&#1090;&#1086; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1089;&#1077; &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072;&#1090; &#1086;&#1073;&#1097;&#1080; 
      &#1076;&#1072;&#1085;&#1085;&#1080;. &#1050;&#1072;&#1090;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077;&#1085; &#1082;&#1088;&#1080;&#1090;&#1077;&#1088;&#1080;&#1081; &#1079;&#1072; &#1086;&#1087;&#1090;&#1080;&#1084;&#1072;&#1083;&#1085;&#1086;&#1089;&#1090;&#1090;&#1072; &#1085;&#1072; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1072;&#1085;&#1077;&#1090;&#1086; &#1085;&#1072; 
      &#1073;&#1072;&#1079;&#1072;&#1090;&#1072; &#1076;&#1072;&#1085;&#1085;&#1080; &#1082;&#1072;&#1090;&#1086; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086; &#1089;&#1077; &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072;&#1090; &#1074;&#1088;&#1077;&#1084;&#1077;&#1074;&#1080;&#1090;&#1077; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1089;&#1090;&#1080;&#1082;&#1080; &#1085;&#1072; 
      &#1080;&#1079;&#1087;&#1098;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077;&#1090;&#1086; &#1085;&#1072; &#1079;&#1072;&#1103;&#1074;&#1082;&#1080;&#1090;&#1077; &#1085;&#1072; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1080;&#1090;&#1077;&#1083;&#1080;&#1090;&#1077; &#1086;&#1090; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080;&#1090;&#1077; &#1079;&#1072; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;.
    </p>
    <p>
      &#1050;&#1088;&#1072;&#1090;&#1082;&#1086; &#1088;&#1077;&#1079;&#1102;&#1084;&#1077;. &#1056;&#1072;&#1079;&#1075;&#1083;&#1077;&#1078;&#1076;&#1072; &#1089;&#1077; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1074;&#1072;&#1085;&#1077;&#1090;&#1086; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1080;&#1090;&#1077; &#1087;&#1086;&#1085;&#1103;&#1090;&#1080;&#1103; &#1079;&#1072; 
      &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1103;&#1085;&#1077; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1080;. &#1054;&#1087;&#1080;&#1089;&#1074;&#1072; &#1082;&#1083;&#1072;&#1089;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1090;&#1077; &#1087;&#1086;&#1085;&#1103;&#1090;&#1080;&#1103; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1080; &#1079;&#1072; 
      &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080;&#1088;&#1072;&#1085;&#1077;, &#1089;&#1074;&#1098;&#1088;&#1079;&#1072;&#1085;&#1080; &#1089; &#1087;&#1088;&#1086;&#1084;&#1077;&#1085;&#1083;&#1080;&#1074;&#1072; (&#1084;&#1072;&#1089;&#1080;&#1074;) &#1080; &#1087;&#1086;&#1103;&#1074;&#1072;&#1090;&#1072; &#1085;&#1072; &#1085;&#1086;&#1074;&#1080; &#1082;&#1086;&#1085;&#1094;&#1077;&#1087;&#1094;&#1080;&#1080; 
      &#1079;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080;&#1088;&#1072;&#1085;&#1077; (&#1079;&#1072;&#1087;&#1080;&#1089; &#1087;&#1086;&#1083;&#1077;, &#1092;&#1072;&#1081;&#1083;), &#1082;&#1072;&#1090;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1080;&#1094;&#1072; &#1086;&#1090; &#1087;&#1086;&#1088;&#1103;&#1076;&#1098;&#1082;&#1072; &#1085;&#1072; 
      &#1088;&#1072;&#1079;&#1096;&#1080;&#1088;&#1103;&#1074;&#1072;&#1085;&#1077; &#1085;&#1072; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080;&#1090;&#1077; &#1080; &#1090;&#1103;&#1093;&#1085;&#1086;&#1090;&#1086; &#1086;&#1090;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1090;&#1072; &#1079;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1080;&#1088;&#1072;&#1085;&#1077;. 
      &#1047;&#1072;&#1076;&#1072;&#1095;&#1072;&#1090;&#1072; &#1077; &#1076;&#1072; &#1080;&#1085;&#1090;&#1077;&#1075;&#1088;&#1080;&#1088;&#1072;&#1090;&#1077; &#1076;&#1072;&#1085;&#1085;&#1080;, &#1082;&#1086;&#1075;&#1072;&#1090;&#1086; &#1089;&#1077; &#1080;&#1079;&#1087;&#1086;&#1083;&#1079;&#1074;&#1072;&#1090; &#1085;&#1103;&#1082;&#1086;&#1083;&#1082;&#1086; &#1086;&#1073;&#1097;&#1080; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; 
      &#1079;&#1072; &#1076;&#1072;&#1085;&#1085;&#1080;. &#1055;&#1086;&#1085;&#1103;&#1090;&#1080;&#1077;&#1090;&#1086; &#1079;&#1072; &#1073;&#1072;&#1079;&#1072; &#1076;&#1072;&#1085;&#1085;&#1080; &#1077; &#1076;&#1077;&#1092;&#1080;&#1085;&#1080;&#1088;&#1072;&#1085;&#1086;.
    </p>
  </body>
</html>
